Ran Plan for dir: `spanner-instance` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "/usr/local/bin/terraform plan -input=false -refresh -out \"/atlantis-data/repos/Onkar179/terraform-sample-repo/5/default/spanner-instance/default.tfplan\"" in "/atlantis-data/repos/Onkar179/terraform-sample-repo/5/default/spanner-instance": exit status 1

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # module.cloud_spanner["test-instance"].google_spanner_instance.instance_processing_units[0] will be created
  + resource "google_spanner_instance" "instance_processing_units" {
      + config           = "regional-us-central1"
      + display_name     = "Spanner demo"
      + effective_labels = {
          + "env" = "demo"
        }
      + force_destroy    = false
      + id               = (known after apply)
      + labels           = {
          + "env" = "demo"
        }
      + name             = "test-instance"
      + num_nodes        = (known after apply)
      + processing_units = 100
      + project          = "onkar-17-cloud"
      + state            = (known after apply)
      + terraform_labels = {
          + "env" = "demo"
        }
    }

  # module.cloud_spanner["test-instance-2"].google_spanner_instance.instance_processing_units[0] will be created
  + resource "google_spanner_instance" "instance_processing_units" {
      + config           = "regional-us-central1"
      + display_name     = "Spanner prod"
      + effective_labels = {
          + "env" = "prod"
        }
      + force_destroy    = false
      + id               = (known after apply)
      + labels           = {
          + "env" = "prod"
        }
      + name             = "test-instance-2"
      + num_nodes        = (known after apply)
      + processing_units = 200
      + project          = "onkar-17-cloud"
      + state            = (known after apply)
      + terraform_labels = {
          + "env" = "prod"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
╷
│ Error: Invalid for_each argument
│ 
│   on ../modules/spanner-instance/main.tf line 35, in resource "google_spanner_instance_iam_member" "instance":
│   35:   for_each = toset(var.instance_iam)
│     ├────────────────
│     │ var.instance_iam is null
│ 
│ The given "for_each" argument value is unsuitable: the given "for_each"
│ argument value is null. A map, or set of strings is allowed.
╵


```
</details>